<ul>
	<li>请提供真实邮箱，并自行保管。邮箱为用户的唯一凭证。</li>
	<li>本站会加密存储用户密码，尽量保证数据安全，但并不保证这些信息的绝对安全。</li>
	<li>禁止使用本站服务进行任何违法恶意活动。</li>
	<li>使用任何节点，需遵循节点所属国家的相关法律以及用户所在国家法律。</li>
	<li>本网站归属于新加坡管辖，使用本站服务需遵守新加坡共和国(Republic of Singapore；Republik Singapura；சிங்கப்பூர் குடியரச；新嘉坡；新加坡共和國)法律。</li>
	<li>禁止滥用本站提供的服务。</li>
	<li>禁止出售本站提供的服务。</li>
	<li>禁止共享本站提供的服务。超过3人以上共享服务，我们有权临时限制账号使用权限。</li>
	<li>对于违反上述条款的用户，我们有权限在不通知的情况下限制、禁用、删除账号。</li>
	<li>对于过期超过X个月，且余额低于X的用户，我们有权利在不通知的情况下删除账号。* X > 0。</li>
	<li>对于余额低于0的账号，本站有权力在不通知的情况下，限制账号的使用权限。</li>
	<li>用户账号因上述原因被限制、禁用、删除，本站有权利收回邀请人的邀请返利。</li>
	<li>任何违反使用条款的用户，我们将会删除违规账户并收回使用本站服务的权利。</li>
</ul>